### Terraform `plan` Succeeded for Workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.lambda_function.aws_lambda_function.this[0] will be updated in-place
!   resource "aws_lambda_function" "this" {
!       handler                        = "main.handler" -> "app.main.handler"
        id                             = "cataprato-auth-lambda"
!       last_modified                  = "2023-08-18T03:50:19.000+0000" -> (known after apply)
!       layers                         = [
-           "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-auth-layer-s3:40",
        ] -> (known after apply)
!       qualified_arn                  = "arn:aws:lambda:us-east-1:350131064538:function:cataprato-auth-lambda:32" -> (known after apply)
!       qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:350131064538:function:cataprato-auth-lambda:32/invocations" -> (known after apply)
!       s3_key                         = "lambda-builds/67c812ae2031e3212f3eb2734d0238ae9f520472160cdfce55348c3e4f88899b.zip" -> "lambda-builds/df3c73ea236af8c310ec220232af91dedd88c879fb82e7711cef1b170f05d29b.zip"
!       s3_object_version              = "GKE5BdkZT_b6pMekaa9NM4cg9OApJgat" -> (known after apply)
        tags                           = {
            "Deployment" = "terraform"
        }
!       version                        = "32" -> (known after apply)
        # (17 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.lambda_function.aws_lambda_permission.current_version_triggers["APIGatewayAny"] will be created
+   resource "aws_lambda_permission" "current_version_triggers" {
+       action              = "lambda:InvokeFunction"
+       function_name       = "cataprato-auth-lambda"
+       id                  = (known after apply)
+       principal           = "apigateway.amazonaws.com"
+       qualifier           = (known after apply)
+       source_arn          = "arn:aws:execute-api:us-east-1:350131064538:qkcy9ocpg8/*/*"
+       statement_id        = "APIGatewayAny"
+       statement_id_prefix = (known after apply)
    }

  # module.lambda_function.aws_s3_object.lambda_package[0] will be created
+   resource "aws_s3_object" "lambda_package" {
+       acl                    = "private"
+       bucket                 = "cataprato-auth-20230809133507800000000001"
+       bucket_key_enabled     = (known after apply)
+       content_type           = (known after apply)
+       etag                   = (known after apply)
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "lambda-builds/df3c73ea236af8c310ec220232af91dedd88c879fb82e7711cef1b170f05d29b.zip"
+       kms_key_id             = (known after apply)
+       server_side_encryption = (known after apply)
+       source                 = "./.terraform/lambda-builds/df3c73ea236af8c310ec220232af91dedd88c879fb82e7711cef1b170f05d29b.zip"
+       storage_class          = "ONEZONE_IA"
+       tags                   = {
+           "Deployment" = "terraform"
        }
+       tags_all               = {
+           "Deployment" = "terraform"
        }
+       version_id             = (known after apply)
    }

  # module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "./.terraform/lambda-builds/"
+               build_plan    = [
+                   [
+                       "set:filter",
+                       [
+                           "!app/.+",
                        ],
                    ],
+                   [
+                       "zip",
+                       "./app",
+                       null,
                    ],
+                   [
+                       "clear:filter",
                    ],
                ]
+               filename      = "./.terraform/lambda-builds/df3c73ea236af8c310ec220232af91dedd88c879fb82e7711cef1b170f05d29b.zip"
+               runtime       = "python3.10"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "./.terraform/lambda-builds/df3c73ea236af8c310ec220232af91dedd88c879fb82e7711cef1b170f05d29b.plan.json"
+       id                   = (known after apply)
    }

  # module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
!       id       = "239001052082427192" -> (known after apply)
!       triggers = {
!           "filename"  = "./.terraform/lambda-builds/67c812ae2031e3212f3eb2734d0238ae9f520472160cdfce55348c3e4f88899b.zip" -> "./.terraform/lambda-builds/df3c73ea236af8c310ec220232af91dedd88c879fb82e7711cef1b170f05d29b.zip"
!           "timestamp" = "1692325988633789000" -> "1692332720988955000"
        }
    }

  # module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_function" {
!       id       = "317528117782651525" -> (known after apply)
!       triggers = {
!           "built_output_path"    = "./.terraform/lambda-builds/67c812ae2031e3212f3eb2734d0238ae9f520472160cdfce55348c3e4f88899b.zip" -> "./.terraform/lambda-builds/df3c73ea236af8c310ec220232af91dedd88c879fb82e7711cef1b170f05d29b.zip"
!           "original_source_code" = jsonencode(
!               [
!                   {
-                       commands = [
-                           ":zip . app/",
                        ]
!                       patterns = [
-                           "!app/.*",
+                           "!app/.+",
                        ]
                        # (1 unchanged attribute hidden)
                    },
                ]
            )
            # (3 unchanged elements hidden)
        }
    }

  # module.lambda_layer_s3.aws_lambda_layer_version.this[0] will be created
+   resource "aws_lambda_layer_version" "this" {
+       arn                         = (known after apply)
+       compatible_runtimes         = [
+           "python3.10",
        ]
+       created_date                = (known after apply)
+       description                 = "Pip layer"
+       id                          = (known after apply)
+       layer_arn                   = (known after apply)
+       layer_name                  = "cataprato-auth-layer-s3"
+       s3_bucket                   = "cataprato-auth-20230809133507800000000001"
+       s3_key                      = "builds/b8378f710d054d831f886d0bab9eaaee4650468ea838ab3d3be1463e6027031c.zip"
+       s3_object_version           = (known after apply)
+       signing_job_arn             = (known after apply)
+       signing_profile_version_arn = (known after apply)
+       skip_destroy                = false
+       source_code_hash            = (known after apply)
+       source_code_size            = (known after apply)
+       version                     = (known after apply)
    }

  # module.lambda_layer_s3.aws_s3_object.lambda_package[0] will be created
+   resource "aws_s3_object" "lambda_package" {
+       acl                    = "private"
+       bucket                 = "cataprato-auth-20230809133507800000000001"
+       bucket_key_enabled     = (known after apply)
+       content_type           = (known after apply)
+       etag                   = (known after apply)
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "builds/b8378f710d054d831f886d0bab9eaaee4650468ea838ab3d3be1463e6027031c.zip"
+       kms_key_id             = (known after apply)
+       server_side_encryption = (known after apply)
+       source                 = "builds/b8378f710d054d831f886d0bab9eaaee4650468ea838ab3d3be1463e6027031c.zip"
+       storage_class          = "ONEZONE_IA"
+       tags                   = {
+           "Deployment" = "terraform"
        }
+       tags_all               = {
+           "Deployment" = "terraform"
        }
+       version_id             = (known after apply)
    }

  # module.lambda_layer_s3.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "zip",
+                       "dist",
+                       null,
                    ],
                ]
+               filename      = "builds/b8378f710d054d831f886d0bab9eaaee4650468ea838ab3d3be1463e6027031c.zip"
+               runtime       = ""
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/b8378f710d054d831f886d0bab9eaaee4650468ea838ab3d3be1463e6027031c.plan.json"
+       id                   = (known after apply)
    }

  # module.lambda_layer_s3.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
!       id       = "2733925318803953813" -> (known after apply)
!       triggers = {
!           "filename"  = "builds/a12005a0246e5329fb177ac5484aa1ad7ca33206aa285182e16e870cf2b2ac3f.zip" -> "builds/b8378f710d054d831f886d0bab9eaaee4650468ea838ab3d3be1463e6027031c.zip"
!           "timestamp" = "1692325990330988000" -> "1692332722548613000"
        }
    }

  # module.lambda_layer_s3.null_resource.sam_metadata_aws_lambda_layer_version[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_layer_version" {
!       id       = "9120285258764984666" -> (known after apply)
!       triggers = {
!           "built_output_path"    = "builds/a12005a0246e5329fb177ac5484aa1ad7ca33206aa285182e16e870cf2b2ac3f.zip" -> "builds/b8378f710d054d831f886d0bab9eaaee4650468ea838ab3d3be1463e6027031c.zip"
            # (4 unchanged elements hidden)
        }
    }

Plan: 10 to add, 1 to change, 4 to destroy.
```
</details>